app/controllers/notes_controller.rb

SELECT * FROM "notes"
---
  def index
    @notes = Note.all

INSERT INTO "notes" ("left", "created_at", "title", "body", "updated_at", "deleted_at", "status", "top") VALUES(NULL, '2009-04-11 06:19:29', 'Note 6', 'I''m out of notes!!', '2009-04-11 06:19:29', NULL, 'normal', NULL)
---
  def create
    @note = Note.new(params[:note])

    respond_to do |format|
      if @note.save

SELECT * FROM "notes" WHERE ("notes"."id" = 1012969240)
---
  def edit
    @note = Note.find(params[:id])

SELECT * FROM "notes" WHERE ("notes"."id" = 1012969228)
UPDATE "notes" SET "updated_at" = '2009-04-07 05:23:07', "left" = 471, "top" = -187 WHERE "id" = 1012969236
---
  def update
    @note = Note.find(params[:id])

    respond_to do |format|
      if @note.update_attributes(params[:note])

SELECT * FROM "notes" WHERE ("notes"."id" = 1012969234)
DELETE FROM "notes" WHERE "id" = 1012969234
UPDATE "notes" SET "updated_at" = '2009-04-11 06:16:54', "deleted_at" = '2009-04-11 06:16:54' WHERE "id" = 1012969242
---
  def destroy
    @note = Note.find(params[:id])
    @note.deleted_at = DateTime.now
    @note.save